---
kind: type
id: T:Autodesk.Revit.DB.MultiReferenceAnnotationOptions
source: html/2e081b6c-38fd-4f03-a372-0dfa841e6248.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions

Options which control the creation of MultiReferenceAnnotations.

## Syntax (C#)
```csharp
public class MultiReferenceAnnotationOptions : IDisposable
```

## Remarks
MultiReferenceAnnotationOptions include the specification of the associated elements and options for the dimension and tag placement.